
# üß© Titanic Dataset Exploration with pandas

üéØ **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why it‚Äôs useful.

In [13]:

import pandas as pd

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")

# Show first few rows
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S


## üß† Step 1: Inspecting the Data

Functions to explore:
- df.head()
- df.tail()
- df.info()
- df.describe()
- df.shape
- df.columns

In [ ]:

# Muestra los 5 primeros objetos del CSV
df.head()

# Muestra los primeros n√∫meros de objetos que indicas entre parentesis, por ejemplo (10)
df.head(10)

# Muestra los 5 √∫ltimos objetos del CSV
df.tail()

# Muestra los √∫ltimos n√∫meros de objetos que indicas entre parentesis, por ejemplo (10)
df.tail(10)

# Resumen del DataFrame (tipos de datos, valores no nulos...)
df.info()

# Genera estad√≠sticas de las columnas num√©ricas.
df.describe()

# Las dimensiones del DataFrame: (n√∫mero_de_filas, n√∫mero_de_columnas)
df.shape

# Una lista de los nombres de todas las columnas
df.columns

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')


## üîç Step 2: Selecting Data

Functions to explore:
- df["column"]
- df[["col1", "col2"]]
- df.loc[]
- df.iloc[]

In [26]:

# Mostrar el head (5 primeros) de la/las columna/s que indiques.
df["Age"].head()
df[["Sex", "Age", "Survived"]].head()

# Muestra las filas con √≠ndice de etiqueta 0, 1 y 2, solo para la columna 'Name'
df.loc[0:2, ["Name"]]

# Muestra las filas en posici√≥n 0, 1 y 2, y las columnas en posici√≥n 1, 2 y 3.
df.iloc[0:3, 1:4]

   Survived  Pclass                                               Name
0         0       3                            Braund, Mr. Owen Harris
1         1       1  Cumings, Mrs. John Bradley (Florence Briggs Th...
2         1       3                             Heikkinen, Miss. Laina


## üîé Step 3: Filtering Rows

Functions to explore:
- df[df["Age"] > 30]
- df.query("Sex == 'female' and Survived == 1")

In [37]:

# Example: Filtering data
df[df["Age"] > 50].head()
df.query("Sex == 'female' and Survived == 1").head()

# Ense√±a los 5 primeros pasajeros que SOBREVIVIERON (Survived = 1)
df[df["Survived"] == 1].head()

# Ense√±a solo a los pasajeros que pagaron una TARIFA (Fare) superior a 247
df[df["Fare"] > 247].head()

# Ense√±a a los pasajeros de PRIMERA CLASE (Pclass = 1) que NO sobrevivieron (Survived = 0)
df[(df["Pclass"] == 1) & (df["Survived"] == 0)].head()


# Ense√±a a todas las MUJERES (Sex = 'female') que sobrevivieron (Survived = 1)
df.query("Sex == 'female' and Survived == 1").head()

# Ense√±a a los menores de 10 a√±os que viajaban en TERCERA CLASE (Pclass = 3)
df.query("Age < 10 and Pclass == 3").head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
16,17,0,3,"Rice, Master. Eugene",male,2.0,4,1,382652,29.1250,NaN,Q
24,25,0,3,"Palsson, Miss. Torborg Danira",female,8.0,3,1,349909,21.0750,NaN,S
50,51,0,3,"Panula, Master. Juha Niilo",male,7.0,4,1,3101295,39.6875,NaN,S


## üßπ Step 4: Handling Missing Data

Functions to explore:
- df.isna()
- df.isna().sum()
- df.dropna()
- df.fillna()

In [5]:

# Example: Check missing values
df.isna().sum()

# Fill missing ages with median
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Age"].head()

# Muestra un DataFrame booleano (True si es faltante, False si tiene valor)
df.isna().head()

# Cuenta el n√∫mero total de valores faltantes por columna
df.isna().sum()

# Elimina (borra) cualquier fila que contenga un valor que falte (como NaN o None).
df.dropna()

# Rellena los valores faltantes (NaN) en el DataFrame con el n√∫mero 0
df.fillna(0)

# Rellena los valores faltantes de la columna "Age" con el n√∫mero est√°tico 25
df["Age"].fillna(25)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64


## üìä Step 5: Grouping and Aggregating

Functions to explore:
- df.groupby("Sex")["Survived"].mean()
- df["Fare"].mean()
- df["Age"].median()

In [7]:

# Example: Aggregation
df.groupby("Sex")["Survived"].mean()
df.groupby("Pclass")["Fare"].mean()

# Calcula la media (promedio) de la tarifa pagada por todos los pasajeros
df["Fare"].mean()

# Calcula la mediana  de la edad de todos los pasajeros
df["Age"].median()

# Muestra la tasa de supervivencia por g√©nero (la media).
df.groupby("Sex")["Survived"].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64


## üìà Step 6: Sorting and Counting

Functions to explore:
- df.sort_values("Age")
- df["Sex"].unique()
- df["Pclass"].value_counts()

In [12]:

# Example: Sorting and counting
df.sort_values("Age").head()
df["Pclass"].value_counts()

# Ordena el DataFrame de forma ascendente bas√°ndose en la columna "Age"
df.sort_values("Age").head()

# Ordena por la columna "Pclass" y, en caso de que sea la misma, ordena por "Age"
df.sort_values(["Pclass", "Age"]).head()

# Muestra una lista de todos los valores √öNICOS de la columna "Sex"
df["Sex"].unique()

# Muestra una lista de todos los valores √öNICOS de la columna "Embarked"
df["Embarked"].unique()

# Cuenta cu√°ntos pasajeros sobrevivieron (Survived=1) y cu√°ntos no (Survived=0)
df["Survived"].value_counts()

Survived
0    549
1    342
Name: count, dtype: int64


## ‚öôÔ∏è Step 7: Creating or Modifying Columns

Functions to explore:
- df.assign()
- df.apply()
- df["new_col"] = ...
- pd.concat()
- pd.merge()

In [18]:

# Example: Create new column
df["Fare_per_Age"] = df["Fare"] / df["Age"]
df[["Age", "Fare", "Fare_per_Age"]].head()

# Crea un nuevo DataFrame con una columna nueva llamada 'Fare_x_2' multiplicando el Fare por dos.
df.assign(Fare_x_2=df["Fare"] * 2).head()

# .apply() para crear la columna 'Tamano_Familia' sumando 'SibSp' y 'Parch' m√°s 1 (para la propia persona)
# El 'axis=1' es para que la funci√≥n se aplique fila por fila.
df["Tamano_Familia"] = df.apply(lambda row: row["SibSp"] + row["Parch"] + 1, axis=1)
df[["SibSp", "Parch", "Tamano_Familia"]].head()

   SibSp  Parch  Tamano_Familia
0      1      0               2
1      1      0               2
2      0      0               1
3      1      0               2
4      0      0               1


## üíæ Step 8: Exporting Data

Function to explore:
- df.to_csv("output.csv", index=False)

In [19]:

# Example: Save cleaned data
df.to_csv("titanic_cleaned.csv", index=False)

# Es para guardar el csv actual en un archivo.


## üß© Step 9: Summary

Reflect on what you learned:
- Which functions were most useful?
- What insights did you gain from the Titanic dataset?

In [ ]:
# Las funciones de filtrado (.query) y agrupaci√≥n (.groupby) fueron las m√°s √∫tiles para obtener informaci√≥n.
# Pues por ejemplo que la supervivencia en el Titanic dependi√≥ mucho del g√©nero y la clase social.